{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "hesitant",
    "1": "urgent",
    "2": "aggressive",
    "3": "bluffing",
    "4": "collaborative",
    "5": "dismissive",
    "6": "enthusiastic",
    "7": "noncommittal"
  },
  "initializer_range": 0.02,
  "label2id": {
    "aggressive": 2,
    "bluffing": 3,
    "collaborative": 4,
    "dismissive": 5,
    "enthusiastic": 6,
    "hesitant": 0,
    "noncommittal": 7,
    "urgent": 1
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.12.1",
  "use_cache": false,
  "vocab_size": 30522
}
